In [1]:
import pandas as pd 
import pyodbc

In [2]:
import boto3

In [29]:
DB = {'servername': 'DESKTOP-1OD4A1P\SQLEXPRESS',
      'database': 'Apartment_KK'}

In [30]:
conn = pyodbc.connect("Driver={SQL Server Native Client 11.0};"
                      "Server=DESKTOP-1OD4A1P\SQLEXPRESS;"
                      "Database=Apartment_KK;"
                      "Trusted_Connection=yes;")

In [7]:
employee = pd.read_sql_query("Select * FROM employee", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [5]:
employee.head()

,EmployeeID,FirstName,LastName,Position,Phone
0,1,Stefanie,Buckley,PV7K69YCDITP12W4URH7LH2ZGIJDHA8I2OWI,954-6445357
1,2,Sandy,Mc Gee,UNTJUMHFCIFMR2S3SP7S73OPKU39B,547864-3163
2,3,Lee,Warren,C6DPZ3ONQVLK303RQ8,590-310-8470
3,4,Regina,Forbes,E9ZOQ7RZ3ZZI84Q59822PF4YB6N0,6555533139
4,5,Daniel,Kim,LT4VTWDCHNH83KORC,571-6254452

In [31]:
parts = pd.read_sql_query("Select * FROM parts", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [32]:
parts.head()

   PartID          Name  UnitPrice  QuantityAvailable  SupplierId
0       1  Pipe Cutters       15.0                980       818.0
1       2      Detector       22.0                209       559.0
2       3         Pipes        4.0                457         2.0
3       4         Pipes        4.0                230       443.0
4       5        Switch       20.0                123       274.0

In [9]:
supplier = pd.read_sql_query("Select * FROM supplier", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [9]:
supplier.head()

   SupplierID        Name  PartID
0           1     Laurie1     1.0
1           2       Tomas     2.0
2           3      Cari19     3.0
3           4  Scottie784     4.0
4           5       Alan7     5.0

In [10]:
partsmaintenance = pd.read_sql_query("Select * FROM Partsmaintenance", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [11]:
partsmaintenance.head()

   PartID  MaintenanceID    Quantity
0     727          818.0  MIXCE
1     818          559.0  I07N6
2     769            2.0  PSU
3     559          443.0  E
4     207          274.0  KH

In [37]:
maintenance = pd.read_sql_query("Select * FROM maintenance", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [38]:
maintenance.head()

   MaintenanceID     Type  ReportDate   StartDate CompletionDate  UnitID
0              1  On-call  1998-08-28  2001-10-01     1968-10-18   818.0
1              2     Full  2007-03-31  1978-09-27     1998-12-25   559.0
2              3     Full  1984-07-16  2012-01-01     1991-03-26     2.0
3              4     Full  2000-01-15  1960-06-30     1975-03-23   443.0
4              5     Full  1958-01-19  2020-05-10     1982-07-05   274.0

In [12]:
employeemaintenance = pd.read_sql_query("Select * FROM employeemaintenance", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [15]:
employeemaintenance.head()

   EmployeeID  MaintenanceID  Hours ResidentFeedback  EmployeeRating
0         727          818.0  73.46            16780   -1.673891e+09
1         818          559.0  86.48            60992   -7.036808e+08
2         769            2.0  92.97            78457    7.159144e+08
3         559          443.0  55.06            92858   -1.091592e+09
4         207          274.0  43.04            09021   -3.399848e+08

In [13]:
lease = pd.read_sql_query("Select * FROM lease", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [17]:
lease.head()

,LeaseID,StartDate,EndDate,MonthlyRent,SecurityDeposit,ResidentID,UnitID
0,1,1965-02-15,2001-03-04,220.5626,742.9880,818.0,818.0
1,2,1955-03-20,1975-06-18,618.9100,912.3287,559.0,559.0
2,3,2021-08-13,2000-11-05,392.3911,91.3791,2.0,2.0
3,4,2015-04-16,1961-01-06,329.6118,543.0548,443.0,443.0
4,5,1973-09-21,2004-11-15,203.2854,654.7712,274.0,274.0

In [23]:
unit = pd.read_sql_query("Select * FROM unit", conn)

In [24]:
unit.head()

   UnitId     Area  Baths    Bed  ParkingNo  Laundry    Type
0       1  8474.07  228.0  106.0      117.0        1  Studio
1       2  1780.52  195.0   14.0      165.0        0    2BHk
2       3  8677.35   68.0  246.0       92.0        1  Studio
3       4  9927.74  107.0  162.0       15.0        0    1BHK
4       5  1928.91   24.0  140.0      115.0        1    1BHK

In [15]:
parking = pd.read_sql_query("Select * FROM parking", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [21]:
parking.head()

   ParkingID  UnitID
0          1   818.0
1          2   559.0
2          3     2.0
3          4   443.0
4          5   274.0

In [16]:
occupants = pd.read_sql_query("Select * FROM occupants", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [23]:
occupants.head()

   MemberID  FirstName    LastName  ResidentID
0         1     Eugene     Hancock       818.0
1         2      Darcy  Montgomery       559.0
2         3     Randal       Garza         2.0
3         4      Donna      Harvey       443.0
4         5  Katherine     Rodgers       274.0

In [17]:
resident = pd.read_sql_query("Select * FROM resident", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [25]:
resident.head()

,ResidentID,FirstName,LastName,EmailAddress,Phone,PermanentAddress
0,1,Kathy,Carrillo,vthl4@ewfr-m.org,145996-6927,147 Second Road
1,2,Rene,Calderon,gytpb.acwyrqumc@occnxz.net,532-820-9424,75 New Road
2,3,Bart,Nelson,mkvwur5@iubakx.net,081-482-2360,792 Green Fabien Avenue
3,4,Ralph,Wood,vdkkdz.arsb@mduefa.org,188138-9412,None
4,5,Shari,Johnson,xfvajnm6@xjcasxb.kaxoim.org,571-771-7116,448 East Oak Avenue

In [41]:
rentpayment = pd.read_sql_query("Select * FROM rentpayment", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [42]:
rentpayment.head()

   PaymentID    Type        Date    Amount  AmountDue  ResidentID  UnitID
0          1  Credit  1986-01-26    1.6930   524.1184       818.0     1.0
1          2   Check  1959-03-06  382.8965   676.3151       559.0     2.0
2          3  Credit  1972-01-08  974.6047   673.5927         2.0     3.0
3          4   Check  1988-02-28  722.9774   936.4203       443.0     4.0
4          5    Cash  1999-12-08  131.6705   583.1563       274.0     5.0

In [19]:
fact_bill = pd.read_sql_query("""SELECT
                                    Resident.ResidentID,
                                    Unit.UnitID,
                                    Lease.LeaseID,
                                    RentPayment.PaymentID,
                                    RentPayment.Date,
                                    RentPayment.Amount,
                                    RentPayment.AmountDue
                                FROM
                                    Resident
                                JOIN
                                    Lease 
                                ON
                                    Lease.ResidentID = Resident.ResidentID
                                JOIN
                                    Unit
                                ON
                                    Lease.UnitID = Unit.UnitID
                                JOIN
                                    RentPayment
                                ON
                                    RentPayment.PaymentID = Unit.UnitID""", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [29]:
fact_bill.head()

   ResidentID  UnitID  LeaseID  PaymentID        Date    Amount  AmountDue
0           1       1      305          1  1986-01-26    1.6930   524.1184
1           2       2        3          2  1959-03-06  382.8965   676.3151
2           2       2      395          2  1959-03-06  382.8965   676.3151
3           3       3      257          3  1972-01-08  974.6047   673.5927
4           4       4      802          4  1988-02-28  722.9774   936.4203

In [20]:
dim_lease = pd.read_sql_query("""SELECT
                                    LeaseID,
                                    StartDate,
                                    EndDate,
                                    MonthlyRent,
                                    SecurityDeposit
                                FROM 
                                    Lease""",conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [31]:
dim_lease.head()

   LeaseID   StartDate     EndDate  MonthlyRent  SecurityDeposit
0        1  1965-02-15  2001-03-04     220.5626         742.9880
1        2  1955-03-20  1975-06-18     618.9100         912.3287
2        3  2021-08-13  2000-11-05     392.3911          91.3791
3        4  2015-04-16  1961-01-06     329.6118         543.0548
4        5  1973-09-21  2004-11-15     203.2854         654.7712

In [25]:
dim_unit = pd.read_sql_query("""SELECT
                                    UnitId,
                                    Area,
                                    Type,
                                    Baths,
                                    Bed,
                                    Laundry,
                                    ParkingNo 
                                FROM 
                                    Unit;""", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [26]:
dim_unit.head()

   UnitId     Area    Type  Baths    Bed  Laundry  ParkingNo
0       1  8474.07  Studio  228.0  106.0        1      117.0
1       2  1780.52    2BHk  195.0   14.0        0      165.0
2       3  8677.35  Studio   68.0  246.0        1       92.0
3       4  9927.74    1BHK  107.0  162.0        0       15.0
4       5  1928.91    1BHK   24.0  140.0        1      115.0

In [50]:
dim_resident = pd.read_sql_query("SELECT * FROM Resident",conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [35]:
dim_resident.head()

,ResidentID,FirstName,LastName,EmailAddress,Phone,PermanentAddress
0,1,Kathy,Carrillo,vthl4@ewfr-m.org,145996-6927,147 Second Road
1,2,Rene,Calderon,gytpb.acwyrqumc@occnxz.net,532-820-9424,75 New Road
2,3,Bart,Nelson,mkvwur5@iubakx.net,081-482-2360,792 Green Fabien Avenue
3,4,Ralph,Wood,vdkkdz.arsb@mduefa.org,188138-9412,None
4,5,Shari,Johnson,xfvajnm6@xjcasxb.kaxoim.org,571-771-7116,448 East Oak Avenue

In [43]:
dim_payment = pd.read_sql_query("""SELECT
                                        PaymentId,
                                        Type,
                                        Date,
                                        Amount,
                                        AmountDue 
                                    FROM 
                                        RentPayment""",conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [44]:
dim_payment.head()

   PaymentId    Type        Date    Amount  AmountDue
0          1  Credit  1986-01-26    1.6930   524.1184
1          2   Check  1959-03-06  382.8965   676.3151
2          3  Credit  1972-01-08  974.6047   673.5927
3          4   Check  1988-02-28  722.9774   936.4203
4          5    Cash  1999-12-08  131.6705   583.1563

In [39]:
fact_maintenance = pd.read_sql_query("""SELECT 
                                            Maintenance.UnitID,
                                            EmployeeMaintenance.EmployeeID,
                                            PartsMaintenance.PartID,
                                            Maintenance.Type,
                                            Maintenance.ReportDate,
                                            Maintenance.StartDate,
                                            Maintenance.CompletionDate
                                        FROM 
                                            EmployeeMaintenance
                                        JOIN 
                                            Maintenance
                                        ON 
                                            Maintenance.MaintenanceID = EmployeeMaintenance.EmployeeID
                                        JOIN 
                                            PartsMaintenance
                                        ON 
                                            PartsMaintenance.MaintenanceId = Maintenance.MaintenanceID; """,conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [40]:
fact_maintenance.head()

   UnitID  EmployeeID  PartID    Type  ReportDate   StartDate CompletionDate
0    43.0         727     166    Full  1999-03-02  2006-10-08     2007-01-20
1    56.0         818     727    Full  1981-11-04  1982-07-05     1981-04-13
2   541.0         769     704    Self  1984-03-18  1964-04-17     1976-07-24
3   502.0         559     818  Random  1998-06-14  2003-10-24     2015-11-18
4   608.0         207     493  Random  2005-08-23  1996-01-03     1996-06-23

In [53]:
dim_employee = pd.read_sql_query("SELECT * FROM Employee;", conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [33]:
dim_parts = pd.read_sql_query("""SELECT 
                                    PartId,
                                    Name,
                                    UnitPRice,
                                    QuantityAvailable
                                FROM 
                                    Parts; """,conn)

C:\Users\Kshitiz\anaconda\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [34]:
dim_parts.head()

   PartId          Name  UnitPRice  QuantityAvailable
0       1  Pipe Cutters       15.0                980
1       2      Detector       22.0                209
2       3         Pipes        4.0                457
3       4         Pipes        4.0                230
4       5        Switch       20.0                123

In [8]:
from io import StringIO

In [9]:
AWS_ACCESS_KEY = "AKIA4CPUYVDHV3XP4KMX"
AWS_SECRET_KEY = "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"
AWS_REGION = "us-east-1"

In [10]:
s3_client = boto3.client("s3",
    aws_access_key_id = AWS_ACCESS_KEY,
    aws_secret_access_key = AWS_SECRET_KEY,
    region_name = AWS_REGION,)

In [11]:
from io import StringIO # python3; python2: BytesIO 
import boto3
#fact_bill
bucket = 'kshitiz-project' # already created on S3
csv_buffer = StringIO()
fact_bill.to_csv(csv_buffer)
response = s3_client.put_object(Bucket = bucket, Key = "Apartment/fact_bill.csv", Body = csv_buffer.getvalue())

NameError: name 'fact_bill' is not defined

In [55]:
#dim_lease
csv_buffer = StringIO()
dim_lease.to_csv(csv_buffer)
response = s3_client.put_object(Bucket = bucket, Key = "Apartment/dim_lease.csv", Body = csv_buffer.getvalue())

In [ ]:
#dim_unit
#dim_resident
#dim_payment

In [27]:
#dim_unit
csv_buffer = StringIO()
dim_unit.to_csv(csv_buffer)
response = s3_client.put_object(Bucket = bucket, Key = "Apartment/dim_unit.csv", Body = csv_buffer.getvalue())

In [57]:
#dim_resident
csv_buffer = StringIO()
dim_resident.to_csv(csv_buffer)
response = s3_client.put_object(Bucket = bucket, Key = "Apartment/dim_resident.csv", Body = csv_buffer.getvalue())

In [45]:
#dim_payment
csv_buffer = StringIO()
dim_payment.to_csv(csv_buffer)
response = s3_client.put_object(Bucket = bucket, Key = "Apartment/dim_payment.csv", Body = csv_buffer.getvalue())

In [46]:
#fact_maintenance 
csv_buffer = StringIO()
fact_maintenance.to_csv(csv_buffer)
response = s3_client.put_object(Bucket = bucket, Key = "Apartment/fact_maintenance.csv", Body = csv_buffer.getvalue())

In [60]:
#dim_employee
csv_buffer = StringIO()
dim_employee.to_csv(csv_buffer)
response = s3_client.put_object(Bucket = bucket, Key = "Apartment/dim_employee.csv", Body = csv_buffer.getvalue())

In [35]:
#dim_parts
csv_buffer = StringIO()
dim_parts.to_csv(csv_buffer)
response = s3_client.put_object(Bucket = bucket, Key = "Apartment/dim_parts.csv", Body = csv_buffer.getvalue())

In [75]:
fact_bill_sql = pd.io.sql.get_schema(fact_bill.reset_index(),'fact_bill')
print(''.join(fact_bill_sql))

CREATE TABLE "fact_bill" (
"index" INTEGER,
  "ResidentID" INTEGER,
  "UnitID" INTEGER,
  "LeaseID" INTEGER,
  "PaymentID" INTEGER,
  "Date" DATE,
  "Amount" REAL,
  "AmountDue" REAL
)

In [76]:
dim_lease_sql = pd.io.sql.get_schema(dim_lease.reset_index(),'dim_lease')
print(''.join(dim_lease_sql))

CREATE TABLE "dim_lease" (
"index" INTEGER,
  "LeaseID" INTEGER,
  "StartDate" DATE,
  "EndDate" DATE,
  "MonthlyRent" REAL,
  "SecurityDeposit" REAL
)

In [28]:
dim_unit_sql = pd.io.sql.get_schema(dim_unit.reset_index(),'dim_unit')
print(''.join(dim_unit_sql))

CREATE TABLE "dim_unit" (
"index" INTEGER,
  "UnitId" INTEGER,
  "Area" REAL,
  "Type" TEXT,
  "Baths" REAL,
  "Bed" REAL,
  "Laundry" INTEGER,
  "ParkingNo" REAL
)

In [78]:
dim_resident_sql = pd.io.sql.get_schema(dim_resident.reset_index(),'dim_resident')
print(''.join(dim_resident_sql))

CREATE TABLE "dim_resident" (
"index" INTEGER,
  "ResidentID" INTEGER,
  "FirstName" TEXT,
  "LastName" TEXT,
  "EmailAddress" TEXT,
  "Phone" TEXT,
  "PermanentAddress" TEXT
)

In [47]:
dim_payment_sql = pd.io.sql.get_schema(dim_payment.reset_index(),'dim_payment')
print(''.join(dim_payment_sql))

CREATE TABLE "dim_payment" (
"index" INTEGER,
  "PaymentId" INTEGER,
  "Type" TEXT,
  "Date" DATE,
  "Amount" REAL,
  "AmountDue" REAL
)

In [48]:
fact_maintenance_sql = pd.io.sql.get_schema(fact_maintenance.reset_index(),'fact_maintenance')
print(''.join(fact_maintenance_sql))

CREATE TABLE "fact_maintenance" (
"index" INTEGER,
  "UnitID" REAL,
  "EmployeeID" INTEGER,
  "PartID" INTEGER,
  "Type" TEXT,
  "ReportDate" DATE,
  "StartDate" DATE,
  "CompletionDate" DATE
)

In [81]:
dim_employee_sql = pd.io.sql.get_schema(dim_employee.reset_index(),'dim_employee')
print(''.join(dim_employee_sql))

CREATE TABLE "dim_employee" (
"index" INTEGER,
  "EmployeeID" INTEGER,
  "FirstName" TEXT,
  "LastName" TEXT,
  "Position" TEXT,
  "Phone" TEXT
)

In [36]:
dim_parts_sql = pd.io.sql.get_schema(dim_parts.reset_index(),'dim_parts')
print(''.join(dim_parts_sql))

CREATE TABLE "dim_parts" (
"index" INTEGER,
  "PartId" INTEGER,
  "Name" TEXT,
  "UnitPRice" REAL,
  "QuantityAvailable" INTEGER
)

In [13]:
import redshift_connector

In [115]:
pip install "redshift_connector[full]"

Requirement already satisfied: redshift_connector[full] in c:\users\kshitiz\anaconda\lib\site-packages (2.0.909)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: setuptools in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (61.2.0)
Requirement already satisfied: boto3<2.0.0,>=1.9.201 in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (1.26.44)
Requirement already satisfied: requests<3.0.0,>=2.23.0 in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (2.27.1)
Requirement already satisfied: botocore<2.0.0,>=1.12.201 in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (1.29.44)

Requirement already satisfied: beautifulsoup4<5.0.0,>=4.7.0 in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (4.11.1)
Requirement already satisfied: scramp<1.5.0,>=1.2.0 in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (1.4.4)
Requirement already satisfied: lxml>=4.6.5 in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (4.8.0)
Requirement already satisfied: packaging in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (21.3)
Requirement already satisfied: pytz>=2020.1 in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (2021.3)
Requirement already satisfied: numpy in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (1.21.5)
Requirement already satisfied: pandas in c:\users\kshitiz\anaconda\lib\site-packages (from redshift_connector[full]) (1.4.2)
Requirement already satisfied: soupsieve>1.2 in c:\users\kshitiz\anaconda\lib\site-packages (from beautifulsoup4<5.0.0,>=4.7.0->redshift_connector[full]) (2.3.1)
Requirement already satisfied: s3transfer<0.7.0,>=0.6.0 in c:\users\kshitiz\anaconda\lib\site-packages (from boto3<2.0.0,>=1.9.201->redshift_connector[full]) (0.6.0)
Requirement already satisfied: jmespath<2.0.0,>=0.7.1 in c:\users\kshitiz\anaconda\lib\site-packages (from boto3<2.0.0,>=1.9.201->redshift_connector[full]) (0.10.0)
Requirement already satisfied: python-dateutil<3.0.0,>=2.1 in c:\users\kshitiz\anaconda\lib\site-packages (from botocore<2.0.0,>=1.12.201->redshift_connector[full]) (2.8.2)
Requirement already satisfied: urllib3<1.27,>=1.25.4 in c:\users\kshitiz\anaconda\lib\site-packages (from botocore<2.0.0,>=1.12.201->redshift_connector[full]) (1.26.9)
Requirement already satisfied: six>=1.5 in c:\users\kshitiz\anaconda\lib\site-packages (from python-dateutil<3.0.0,>=2.1->botocore<2.0.0,>=1.12.201->redshift_connector[full]) (1.16.0)
Requirement already satisfied: idna<4,>=2.5 in c:\users\kshitiz\anaconda\lib\site-packages (from requests<3.0.0,>=2.23.0->redshift_connector[full]) (3.3)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\kshitiz\anaconda\lib\site-packages (from requests<3.0.0,>=2.23.0->redshift_connector[full]) (2021.10.8)
Requirement already satisfied: charset-normalizer~=2.0.0 in c:\users\kshitiz\anaconda\lib\site-packages (from requests<3.0.0,>=2.23.0->redshift_connector[full]) (2.0.4)
Requirement already satisfied: asn1crypto>=1.5.1 in c:\users\kshitiz\anaconda\lib\site-packages (from scramp<1.5.0,>=1.2.0->redshift_connector[full]) (1.5.1)
Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in c:\users\kshitiz\anaconda\lib\site-packages (from packaging->redshift_connector[full]) (3.0.4)

In [99]:
import psycopg2

In [14]:
conn = redshift_connector.connect(
     host = 'redshift-cluster-1.cop1zaerfo5o.us-east-1.redshift.amazonaws.com',
     database ='dev',
     user = 'awsuser',
     password  = 'Kharel1234'
  )

In [15]:
conn.autocommit = True

In [16]:
cursor = redshift_connector.Cursor = conn.cursor()

In [34]:
cursor.execute("""CREATE TABLE "dim_payment" (
"index" INTEGER,
  "PaymentId" INTEGER,
  "Type" TEXT,
  "Date" DATE,
  "Amount" REAL,
  "AmountDue" REAL
) """)

In [64]:
#fact_bill
cursor.execute("""CREATE TABLE "fact_bill" (
"index" INTEGER,
  "ResidentID" INTEGER,
  "UnitID" INTEGER,
  "LeaseID" INTEGER,
  "PaymentID" INTEGER,
  "Date" DATE,
  "Amount" REAL,
  "AmountDue" REAL
)""")

In [17]:
cursor.execute("""CREATE TABLE "dim_unit" (
"index" INTEGER,
  "UnitId" INTEGER,
  "Area" REAL,
  "Type" TEXT,
  "Baths" REAL,
  "Bed" REAL,
  "Laundry" INTEGER,
  "ParkingNo" REAL
)""")

In [9]:
cursor.execute("""CREATE TABLE "dim_lease" (
"index" INTEGER,
  "LeaseID" INTEGER,
  "StartDate" DATE,
  "EndDate" DATE,
  "MonthlyRent" REAL,
  "SecurityDeposit" REAL
)""")

cursor.execute("""CREATE TABLE "dim_unit" (
"index" INTEGER,
  "UnitId" INTEGER,
  "Area" REAL,
  "Type" TEXT,
  "Baths" REAL,
  "Bed" REAL,
  "Laundry" INTEGER,
  "ParkingNo" REAL
)""")

cursor.execute("""CREATE TABLE "dim_resident" (
"index" INTEGER,
  "ResidentID" INTEGER,
  "FirstName" TEXT,
  "LastName" TEXT,
  "EmailAddress" TEXT,
  "Phone" TEXT,
  "PermanentAddress" TEXT
)""")

cursor.execute("""CREATE TABLE "dim_payment" (
"index" INTEGER,
  "PaymentId" INTEGER,
  "Type" TEXT,
  "Date" DATE,
  "Amount" REAL,
  "AmountDue" REAL
) """)

cursor.execute("""CREATE TABLE "fact_maintenance" (
"index" INTEGER,
  "UnitID" REAL,
  "EmployeeID" INTEGER,
  "PartID" INTEGER,
  "Type" TEXT,
  "ReportDate" DATE,
  "ProblemDescription" TEXT,
  "StartDate" DATE,
  "CompletionDate" DATE
)""")

cursor.execute("""CREATE TABLE "dim_employee" (
"index" INTEGER,
  "EmployeeID" INTEGER,
  "FirstName" TEXT,
  "LastName" TEXT,
  "Position" TEXT,
  "Phone" TEXT
)""")

cursor.execute("""CREATE TABLE "dim_parts" (
"index" INTEGER,
  "PartId" INTEGER,
  "Name" TEXT,
  "UnitPRice" REAL,
  "QuantityAvailable" INTEGER
)""")

In [65]:
cursor.execute("""
copy fact_bill 
from 's3://kshitiz-project/Apartment/fact_bill.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

In [62]:
#dim_lease
cursor.execute("""
copy dim_lease 
from 's3://kshitiz-project/Apartment/dim_lease.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

In [ ]:
#dim_resident
cursor.execute("""
copy dim_resident 
from 's3://kshitiz-project/Apartment/dim_resident.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

In [35]:
#dim_payment
cursor.execute("""
copy dim_payment 
from 's3://kshitiz-project/Apartment/dim_payment.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

ProgrammingError: {'S': 'ERROR', 'C': 'XX000', 'M': "Load into table 'dim_payment' failed.  Check 'stl_load_errors' system table for details.", 'F': '../src/pg/src/backend/commands/commands_copy.c', 'L': '712', 'R': 'CheckMaxRowError'}

In [18]:
#dim_unit
cursor.execute("""
copy dim_unit 
from 's3://kshitiz-project/Apartment/dim_unit.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

ProgrammingError: {'S': 'ERROR', 'C': 'XX000', 'M': "Load into table 'dim_unit' failed.  Check 'stl_load_errors' system table for details.", 'F': '../src/pg/src/backend/commands/commands_copy.c', 'L': '712', 'R': 'CheckMaxRowError'}

In [ ]:
#dim_payment
cursor.execute("""
copy dim_payment 
from 's3://kshitiz-project/Apartment/dim_payment.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#dim_unit
cursor.execute("""
copy dim_unit 
from 's3://kshitiz-project/Apartment/dim_unit.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#dim_employee
cursor.execute("""
copy dim_employee 
from 's3://kshitiz-project/Apartment/dim_employee.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#dim_parts
cursor.execute("""
copy dim_parts 
from 's3://kshitiz-project/Apartment/dim_parts.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#fact_maintenance
cursor.execute("""
copy dim_resident 
from 's3://kshitiz-project/Apartment/dim_resident.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

In [ ]:
import redshift_connector

conn = redshift_connector.connect(
     host = 'redshift-cluster-1.cop1zaerfo5o.us-east-1.redshift.amazonaws.com',
     database ='dev',
     user = 'awsuser',
     password  = 'Kharel1234'
  )

conn.autocommit = True

cursor = redshift_connector.Cursor = conn.cursor()

#fact_bill
cursor.execute("""CREATE TABLE "fact_bill" (
"index" INTEGER,
  "ResidentID" INTEGER,
  "UnitID" INTEGER,
  "LeaseID" INTEGER,
  "PaymentID" INTEGER,
  "Date" DATE,
  "Amount" REAL,
  "AmountDue" REAL
)""")

cursor.execute("""CREATE TABLE "dim_lease" (
"index" INTEGER,
  "LeaseID" INTEGER,
  "StartDate" DATE,
  "EndDate" DATE,
  "MonthlyRent" REAL,
  "SecurityDeposit" REAL
)""")

cursor.execute("""CREATE TABLE "dim_unit" (
"index" INTEGER,
  "UnitId" INTEGER,
  "Area" REAL,
  "Type" TEXT,
  "Baths" REAL,
  "Bed" REAL,
  "Laundry" TEXT,
  "ParkingNo" REAL
)""")

cursor.execute("""CREATE TABLE "dim_resident" (
"index" INTEGER,
  "ResidentID" INTEGER,
  "FirstName" TEXT,
  "LastName" TEXT,
  "EmailAddress" TEXT,
  "Phone" TEXT,
  "PermanentAddress" TEXT
)""")

cursor.execute("""CREATE TABLE "dim_payment" (
"index" INTEGER,
  "PaymentId" INTEGER,
  "Type" TEXT,
  "Date" DATE,
  "Amount" REAL,
  "AmountDue" REAL
) """)

cursor.execute("""CREATE TABLE "fact_maintenance" (
"index" INTEGER,
  "UnitID" REAL,
  "EmployeeID" INTEGER,
  "PartID" INTEGER,
  "Type" TEXT,
  "ReportDate" DATE,
  "ProblemDescription" TEXT,
  "StartDate" DATE,
  "CompletionDate" DATE
)""")

cursor.execute("""CREATE TABLE "dim_employee" (
"index" INTEGER,
  "EmployeeID" INTEGER,
  "FirstName" TEXT,
  "LastName" TEXT,
  "Position" TEXT,
  "Phone" TEXT
)""")

cursor.execute("""CREATE TABLE "dim_parts" (
"index" INTEGER,
  "PartId" INTEGER,
  "Name" TEXT,
  "Description" TEXT,
  "UnitPRice" REAL,
  "QuantityAvailable" REAL
)""")


#Copy from s3 to Redshift

#fact_bill
cursor.execute("""
copy fact_bill 
from 's3://kshitiz-project/Apartment/fact_bill.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#dim_lease
cursor.execute("""
copy dim_lease 
from 's3://kshitiz-project/Apartment/dim_lease.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#dim_resident
cursor.execute("""
copy dim_resident 
from 's3://kshitiz-project/Apartment/dim_resident.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#dim_payment
cursor.execute("""
copy dim_payment 
from 's3://kshitiz-project/Apartment/dim_payment.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#dim_unit
cursor.execute("""
copy dim_unit 
from 's3://kshitiz-project/Apartment/dim_unit.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#dim_employee
cursor.execute("""
copy dim_employee 
from 's3://kshitiz-project/Apartment/dim_employee.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#dim_parts
cursor.execute("""
copy dim_parts 
from 's3://kshitiz-project/Apartment/dim_parts.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")

#fact_maintenance
cursor.execute("""
copy dim_resident 
from 's3://kshitiz-project/Apartment/dim_resident.csv'
credentials 'aws_iam_role=arn:aws:iam::829978880207:role/s3-redshift'
delimiter ','
region 'us-east-1'
IGNOREHEADER 1
""")